In [3]:
import pandas as pd

In [4]:
df=pd.read_excel("C:/Users/Kshitij/OneDrive/Desktop/DSBDAL/Assignment 1/Data/Demo Marks.xlsx")

In [5]:
df.head(10)

,Roll no,Name of Student,Previous Year SPPU Total Marks out of 1400,%,UT 1 Marks,%.1,50% maks of Previous Year SPPU Result,50% Marks of Unit Test 1,Total 100%
0,1,RAVAL MEET MAHESH,1131,80.785714,29,96.666667,44.0,41,85.0
1,2,HUMBE BHAKTI RAJENDRA,1107,79.071429,29,96.666667,42.0,41,83.0
2,3,MARATHE SANSKRUTI JAGDISH,995,71.071429,27,90.000000,41.0,41,82.0
3,4,THAKARE MRUNALI VINOD,1077,76.928571,28,93.333333,43.0,39,82.0
4,5,BHONGALE OMKAR MADHUKAR,1064,76.000000,28,93.333333,42.0,38,80.0
5,6,THETE SANJIVANI SANTOSH,1129,80.642857,29,96.666667,43.0,37,80.0
6,7,KHATAL NANDINI RAJENDRA,1084,77.428571,24,80.000000,43.0,37,80.0
7,8,SHELKE GAURAV GIRISH,1184,84.571429,25,83.333333,44.0,36,80.0
8,9,DEVANSHU SHARMA,1095,78.214286,25,83.333333,42.0,37,79.0
9,10,SAHASRABUDHE SOHAM MILIN,1203,85.928571,26,86.666667,45.0,34,79.0

In [6]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 74 entries, 0 to 73
Data columns (total 9 columns):
 #   Column                                       Non-Null Count  Dtype
---  ------                                       --------------  -----
 0   Roll no                                      74 non-null     int64
 1   Name of Student                              74 non-null     str
 2   Previous Year SPPU Total Marks out of  1400  74 non-null     int64
 3   %                                            74 non-null     float64
 4   UT 1 Marks                                   74 non-null     int64
 5   %.1                                          74 non-null     float64
 6   50% maks of Previous Year SPPU Result        74 non-null     float64
 7   50% Marks of Unit Test 1                     74 non-null     int64
 8   Total 100%                                   74 non-null     float64
dtypes: float64(4), int64(4), str(1)
memory usage: 5.3 KB

In [7]:
print(df)

    Roll no            Name of Student  \
0         1          RAVAL MEET MAHESH
1         2      HUMBE BHAKTI RAJENDRA
2         3  MARATHE SANSKRUTI JAGDISH
3         4      THAKARE MRUNALI VINOD
4         5    BHONGALE OMKAR MADHUKAR
..      ...                        ...
69       70      KUNWAR ABHIJEET SINGH
70       71             TUPE OM KISHOR
71       72       DARWEY RUDRA GUNWANT
72       73       JAGTAP HARISH YUVRAJ
73       74               ASHUTOSH RAJ

    Previous Year SPPU Total Marks out of  1400          %  UT 1 Marks  \
0                                          1131  80.785714          29
1                                          1107  79.071429          29
2                                           995  71.071429          27
3                                          1077  76.928571          28
4                                          1064  76.000000          28
..                                          ...        ...         ...
69                                          725  51.785714          13
70                                          756  54.000000           4
71                                          608  43.428571          26
72                                          542  38.714286          18
73                                          646  46.142857          14

          %.1  50% maks of Previous Year SPPU Result  \
0   96.666667                              44.000000
1   96.666667                              42.000000
2   90.000000                              41.000000
3   93.333333                              43.000000
4   93.333333                              42.000000
..        ...                                    ...
69  43.333333                              25.892857
70  13.333333                              27.000000
71  86.666667                              21.714286
72  60.000000                              19.357143
73  46.666667                              23.071429

    50% Marks of Unit Test 1  Total 100%
0                         41   85.000000
1                         41   83.000000
2                         41   82.000000
3                         39   82.000000
4                         38   80.000000
..                       ...         ...
69                        29   54.892857
70                        25   52.000000
71                        29   50.714286
72                        31   50.357143
73                        22   45.071429

[74 rows x 9 columns]

In [8]:
df.describe()

,Roll no,Previous Year SPPU Total Marks out of 1400,%,UT 1 Marks,%.1,50% maks of Previous Year SPPU Result,50% Marks of Unit Test 1,Total 100%
count,74.000000,74.000000,74.000000,74.000000,74.000000,74.000000,74.000000,74.000000
mean,37.500000,951.567568,67.969112,23.432432,78.108108,34.394788,33.635135,68.029923
std,21.505813,141.310024,10.093573,4.935422,16.451405,5.595003,4.961701,8.241659
min,1.000000,542.000000,38.714286,4.000000,13.333333,19.357143,21.000000,45.071429
25%,19.250000,880.000000,62.857143,21.000000,70.000000,31.428571,31.000000,63.910714
50%,37.500000,970.000000,69.285714,24.000000,80.000000,34.642857,34.000000,68.892857
75%,55.750000,1059.750000,75.696429,27.000000,90.000000,37.848214,37.000000,73.303571
max,74.000000,1203.000000,85.928571,29.000000,96.666667,45.000000,41.000000,85.000000

In [9]:
print(df.duplicated(keep="first"))

0     False
1     False
2     False
3     False
4     False
      ...
69    False
70    False
71    False
72    False
73    False
Length: 74, dtype: bool

In [10]:
df.isnull().sum()

Roll no                                        0
Name of Student                                0
Previous Year SPPU Total Marks out of  1400    0
%                                              0
UT 1 Marks                                     0
%.1                                            0
50% maks of Previous Year SPPU Result          0
50% Marks of Unit Test 1                       0
Total 100%                                     0
dtype: int64

In [11]:
df.loc[4]

Roll no                                                              5
Name of Student                                BHONGALE OMKAR MADHUKAR
Previous Year SPPU Total Marks out of  1400                       1064
%                                                                 76.0
UT 1 Marks                                                          28
%.1                                                          93.333333
50% maks of Previous Year SPPU Result                             42.0
50% Marks of Unit Test 1                                            38
Total 100%                                                        80.0
Name: 4, dtype: object

In [16]:
df2=df.iloc[:,:4]

In [17]:
df2

,Roll no,Name of Student,Previous Year SPPU Total Marks out of 1400,%
0,1,RAVAL MEET MAHESH,1131,80.785714
1,2,HUMBE BHAKTI RAJENDRA,1107,79.071429
2,3,MARATHE SANSKRUTI JAGDISH,995,71.071429
3,4,THAKARE MRUNALI VINOD,1077,76.928571
4,5,BHONGALE OMKAR MADHUKAR,1064,76.000000
...,...,...,...,...
69,70,KUNWAR ABHIJEET SINGH,725,51.785714
70,71,TUPE OM KISHOR,756,54.000000
71,72,DARWEY RUDRA GUNWANT,608,43.428571
72,73,JAGTAP HARISH YUVRAJ,542,38.714286
73,74,ASHUTOSH RAJ,646,46.142857